package com.xgy.myweb.common;

/**
 * Created by hadoop on 2017/9/2.
 */

//用户：300开始

public enum ResponseCode {
    CODE_100(100, "请求成功"),
    CODE_200(200, "请求错误"),
    CODE_201(201, "缺少必要参数"),
    CODE_300(300, "用户注册失败");
//    CODE_300(300, "服务器繁忙"),
//    CODE_301(301, "请求失败，请重新操作"),
//    CODE_302(302, "非法请求"),
//    CODE_303(303, "请求失败，请重新操作"),
//    CODE_401(401, "账户请求异常"),
//    CODE_403(403, "账号不合法"),
//    CODE_304(304, "收藏失败"),
//    CODE_305(305, "取消收藏失败"),
//    CODE_306(306, "添加历史失败"),
//    CODE_307(307, "非收藏"),
//    CODE_308(308, "保存失败"),
//    CODE_309(309, "登录成功没有绑定机器"),
//    CODE_310(310, "登录成功已经绑定机器绑定机器"),
//    CODE_2000(2000, "请求错误，请重新登陆"),
//    CODE_2001(2001, "发送短信过于频繁"),
//    CODE_2002(2002, "验证码验证失败，请重新获取验证码"),
//    CODE_2003(2003, "验证码验证失败，请重新输入"),
//    CODE_2004(2004, "您的操作时间过长，请重新操作"),
//    CODE_2005(2005, "账号已存在，请登陆"),
//    CODE_2006(2006, "短信发送错误，请重新获取验证码"),
//    CODE_2007(2007, "账号不存在"),
//    CODE_2008(2008, "账号登陆失败，请重新登陆"),
//    CODE_2009(2009, "原密码不正确，请重新输入"),
//    CODE_2100(2100, "不存在情侣关系"),
//    CODE_2110(2110, "不能和自己配对"),
//    CODE_2112(2112, "用户不存在"),
//    CODE_2113(2113, "对方已有配对情侣关系"),
//    CODE_2114(2114, "没有删除成功"),
//    CODE_2115(2115, "不可重复发送请求"),
//    CODE_2200(2200, "系统内部错误"),
//    CODE_2201(2201, "系统内部错误"),
//    CODE_2202(2202, "免登陆信息已过期，请重新登陆"),
//    CODE_2203(2203, "登陆过期，请重新登陆"),
//    CODE_2204(2204, "登陆过期，请重新登陆"),
//    CODE_2205(2205, "用户名或密码错误"),
//    CODE_2206(2206, "登陆过期，请重新登陆"),
//    CODE_2207(2207, "登陆过期，请重新登陆"),
//    CODE_2208(2208, "登陆过期，请重新登陆"),
//    CODE_2209(2209, "登陆过期，请重新登陆"),
//    CODE_2210(2210, "登陆过期，请重新登陆"),
//    CODE_2211(2211, "登陆过期，请重新登陆"),
//    CODE_2212(2212, "登陆过期，请重新登陆"),
//    CODE_2213(2213, "登陆过期，请重新登陆"),
//    CODE_2214(2214, "登陆过期，请重新登陆"),
//    CODE_2501(2501, "闹钟超过最大数量"),
//    CODE_2502(2502, "修改错误"),
//    CODE_2503(2503, "创建闹钟失败，请重新尝试"),
//    CODE_2504(2504, "删除闹钟失败，请重新尝试"),
//    CODE_2505(2505, "删除提醒失败，请重新尝试"),
//    CODE_2506(2506, "设置提醒的时间不可早于目前时间！"),
//    CODE_2507(2507, "提醒超过最大数量"),
//    CODE_2508(2508, "同一时间创建重复提醒"),
//    CODE_2509(2509, "同一时间创建重复闹钟"),
//    CODE_3501(3501, "家电超过最大数量(5个)"),
//    CODE_4001(4001, "已是最新版本"),
//    CODE_4002(4002, "数据异常，数据库未发现版本"),
//    CODE_4003(4003, "机器sn不存在"),
//    CODE_252(252, "该用户已经收藏过此专辑"),
//    CODE_251(251, "该用户没有收藏过此专辑"),
//    CODE_253(253, "您添加的样机已经有管理员了"),
//    CODE_1101(1101, "请求登陆"),
//    CODE_1102(1102, "心跳"),
//    CODE_1103(1103, "获取绑定账户的token"),
//    CODE_1201(1201, "缺少必要参数"),
//    CODE_1202(1202, "回复心跳"),
//    CODE_1203(1203, "登陆成功"),
//    CODE_1204(1204, "该机器人还未绑定账户"),
//    CODE_1205(1205, "获取token成功"),
//    CODE_1300(1300, ""),
//    CODE_1310(1310, "好友申请"),
//    CODE_1311(1311, "更新闹钟"),
//    CODE_1312(1312, "更新提醒"),
//    CODE_1313(1313, "绑定机器人成功"),
//    CODE_1314(1314, "解绑绑定机器人"),
//    CODE_1315(1315, "请登录或重新登录"),
//    CODE_1316(1316, "机器已经被其他用户绑定"),
//    CODE_1317(1317, "用户已经绑定其他机器"),
//    CODE_1378(1378, "绑定失败"),
//    CODE_1379(1379, "解绑失败"),
//    CODE_1380(1380, "任务时长不够"),
//    CODE_1381(1381, "任务过期了"),
//    CODE_1382(1382, "等级不够完成预约任务"),
//    CODE_1383(1383, "技能级别不够升级"),
//    CODE_1384(1384, "不能同时接受两个或以上任务"),
//    CODE_1385(1385, "机器有接受任务未完成，或者正在做任务"),
//    CODE_1386(1386, "用户称号升级失败，完成任务数不够"),
//    CODE_1387(1387, "接受任务失败，琥珀正在洗澡"),
//    CODE_1400(1400, ""),
//    CODE_1500(1500, "TCP服务器错误"),
//    CODE_1501(1501, "TCP服务器APP未登陆"),
//    CODE_1502(1502, "TCP服务器机器未登陆"),
//    CODE_1600(1600, "增加经验失败"),
//    CODE_1601(1601, "身体原因或者有任务在执行，拒绝训练"),
//    CODE_1602(1602, "接受训练"),
//    CODE_1603(1603, "体力值为0，拒绝训练"),
//    CODE_1604(1604, "结束训练"),
//    CODE_1605(1605, "暂停训练"),
//    CODE_1606(1606, "恢复训练"),
//    CODE_1700(1700, "货币不足"),
//    CODE_1701(1701, "无对应模版"),
//    CODE_1702(1702, "已经拥有不能再次购买"),
//    CODE_1703(1703, "传入参数错误"),
//    CODE_1704(1704, "未绑定手机"),
//    CODE_1705(1705, "不符合购买条件"),
//    CODE_1706(1706, "衣橱为空"),
//    CODE_1707(1707, "金币不足"),
//    CODE_1708(1708, "钻石不足"),
//    CODE_1709(1709, "饥饿值达到上限"),
//    CODE_1710(1710, "情绪值达到上限"),
//    CODE_1711(1711, "好感度达到上限"),
//    CODE_1712(1712, "体力值达到上限"),
//    CODE_1713(1713, "购买失败，当前无减益状态，不需要这个道具"),
//    CODE_1801(1801, "无升级信息");

    private int code;
    private String desc;

    ResponseCode(int code, String desc) {
        this.code = code;
        this.desc = desc;
    }

    public int getCode() {
        return this.code;
    }

    public String getDesc() {
        return this.desc;
    }

    public static ResponseCode getByValue(int code) {
        ResponseCode[] values = values();
        ResponseCode[] var2 = values;
        int var3 = values.length;

        for(int var4 = 0; var4 < var3; ++var4) {
            ResponseCode value = var2[var4];
            if(code == value.getCode()) {
                return value;
            }
        }

        return CODE_200;
    }
}
